Revit 2027 API
BuiltInFailures.ParameterFailures.UnrecognizedSharedParameterDataType Property
 The shared parameter '...' with name '...' cannot be added because its data type is not recognized.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnrecognizedSharedParameterDataType { get; }
Public Shared ReadOnly Property UnrecognizedSharedParameterDataType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnrecognizedSharedParameterDataType {
	FailureDefinitionId^ get ();
}
static member UnrecognizedSharedParameterDataType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ParameterFailures Class
Autodesk.Revit.DB Namespace